In [1]:
# Missing Values with Pandas
import pandas as pd
import numpy as np

my_df = pd.DataFrame({"A": [1, 2, 4, np.nan, 5, np.nan, 7],
                      "B": [4, np.nan, 7, np.nan, 1, np.nan, 2]})

In [2]:
# Finding missing values with pandas
my_df.isna()

       A      B
0  False  False
1  False   True
2  False  False
3   True   True
4  False  False
5   True   True
6  False  False

In [3]:
my_df.isna().sum()

A    2
B    3
dtype: int64

In [4]:
# Dropping missing values with pandas
my_df.dropna()

     A    B
0  1.0  4.0
2  4.0  7.0
4  5.0  1.0
6  7.0  2.0

In [5]:
my_df.dropna(how="any")

     A    B
0  1.0  4.0
2  4.0  7.0
4  5.0  1.0
6  7.0  2.0

In [6]:
my_df.dropna(how="all")

     A    B
0  1.0  4.0
1  2.0  NaN
2  4.0  7.0
4  5.0  1.0
6  7.0  2.0

In [7]:
my_df.dropna(how="any", subset=["B"])

     A    B
0  1.0  4.0
2  4.0  7.0
4  5.0  1.0
6  7.0  2.0

In [8]:
my_df.dropna(how="any", inplace=True)
my_df

     A    B
0  1.0  4.0
2  4.0  7.0
4  5.0  1.0
6  7.0  2.0

In [9]:
# Filling missing values with pandas
my_df = pd.DataFrame({"A": [1, 2, 4, np.nan, 5, np.nan, 7],
                      "B": [4, np.nan, 7, np.nan, 1, np.nan, 2]})

In [10]:
my_df.fillna(value=100)  # not recommended

       A      B
0    1.0    4.0
1    2.0  100.0
2    4.0    7.0
3  100.0  100.0
4    5.0    1.0
5  100.0  100.0
6    7.0    2.0

In [11]:
mean_value = my_df["A"].mean()
my_df["A"].fillna(value=mean_value)

0    1.0
1    2.0
2    4.0
3    3.8
4    5.0
5    3.8
6    7.0
Name: A, dtype: float64

In [12]:
my_df.fillna(value=my_df.mean(), inplace=True)
my_df

     A    B
0  1.0  4.0
1  2.0  3.5
2  4.0  7.0
3  3.8  3.5
4  5.0  1.0
5  3.8  3.5
6  7.0  2.0